app/views/articles/show.html.erb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]
---
    <ul class="pager">
      <li><%= link_to "Previous", Article.find_by_id(@article.previous_article_id) %></li>

SELECT "images".* FROM "images" WHERE "images"."article_id" = 2 LIMIT 1
---
    <div class="span4">
      <% @article.images.each do |image| %>

SELECT "videos".* FROM "videos" WHERE "videos"."article_id" = 2
---
    <h4>Videos</h2>
    <% @article.videos.each do |video| %>