app/controllers/articles_controller.rb

  def home
    @article = Article.find(2)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 0]]

  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("created_at", "next_article_id", "previous_article_id", "text", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "articles" SET "title" = '1. Charred body found after US manhunt for Christopher Dorner', "text" = 'California police say they have found a body in a burnt-out cabin where murder suspect Christopher Dorner is believed to have made his deadly last stand.