app/controllers/images_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "images" ("article_id", "created_at", "image_url", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", 1], ["created_at", Fri, 15 Feb 2013 14:16:00 UTC +00:00], ["image_url", "1-2.jpg"], ["updated_at", Fri, 15 Feb 2013 14:20:41 UTC +00:00]]
---
  def create
    @article = Article.find(params[:article_id])
    @image = @article.images.create(params[:image])