app/controllers/videos_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "videos" ("article_id", "created_at", "updated_at", "video_url") VALUES (?, ?, ?, ?)  [["article_id", 1], ["created_at", Fri, 15 Feb 2013 16:22:00 UTC +00:00], ["updated_at", Fri, 15 Feb 2013 16:22:39 UTC +00:00], ["video_url", "1-1v.mp4"]]
---
  def create
    @article = Article.find(params[:article_id])
    @video = @article.videos.create(params[:video])

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "videos".* FROM "videos" WHERE "videos"."article_id" = 1 AND "videos"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "videos" WHERE "videos"."id" = ?  [["id", 1]]
---
  def destroy
    @article = Article.find(params[:article_id])
    @video = @article.videos.find(params[:id])
    @video.destroy